Revit 2015 API
BuiltInFailures.FabricSheetFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.FabricSheetFailures type exposes the following members.
Properties
Name | Description
FabricSheetOutSideOfHostError
 Fabric Sheet is placed completely outside of its host.
FabricSheetOutSideOfHostWarning
 Fabric Sheet is placed completely outside of its host.
See Also
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace